# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Install ZSH
brew 'zsh'

# Install Binaries
brew 'docker'
brew 'git'
brew 'go'
brew 'tree'
brew 'node'
brew 'neovim'
brew 'pnpm'
brew 'ripgrep'
brew 'rust'
brew 'rustup-init'
brew 'rustup-analyzer'
brew 'rustfmt'
brew 'wget'
brew 'yarn'

# Apps
cask 'blender'
cask 'discord'
cask 'fork'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'spotify'
cask 'steam'
cask 'visual-studio-code'
cask 'slack' 